import java.util.Scanner;

public class Test_1_4_6 {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        int n = in.nextInt();

        System.out.println(n & (n - 1));
    }
}
//Так как точная степень двойки не должна быть равна какому - то числу N (или в выводе будет 0), то
//Нам нужно применить выражение,характерное для степени 2 - N & (N - 1) == 0
//Пусть N = 8 тогда N = 1000 а N - 1 = 0111. То есть вычитание единственной единицы
//Приводит к тому что все нули справа обращаются в 1 и значит 1000 & 0111 = 0 !
//Это работает только для степени двойки, а ненулевое число, для остальных

//Тест из 6 вопросов 1.4 Задача 6